# 'brew tap'
tap "homebrew/bundle"
tap "hashicorp/tap"
tap "homebrew/services"

# core
brew "vim"
brew "git"
brew "zsh"
brew "tmux"
brew "starship"
brew "make"
brew "gcc"

# neovim & dependencies
brew "ack"
brew "fd"
brew "fzf"
brew "neovim"
brew "ripgrep"
brew "universal-ctags"

# python & env
brew "autoenv"
brew "pyenv"

# go
brew "go"
brew "goenv"
brew "golangci-lint"

# rust
brew "rust"
brew "rustup"
brew "rust-analyzer"
brew "rustfmt"

# java
# brew "sdkman"

# node
brew "nvm"
brew "yarn"
brew "npm"

# modern cli
brew "bat"
brew "tig"
brew "htop"
brew "k9s"
brew "httpie"
brew "ijq"
brew "jq"
brew "yq"
brew "tree"
brew "wget"
brew "tldr"
brew "mkcert"
brew "dnsmasq"
brew "caddy"
brew "pre-commit"
brew "gh"


# lib*
brew "libevent"
brew "libfaketime"
brew "libmagic"
brew "libuv"
brew "libxml2"
brew "libxslt"
brew "libyaml"

# containers
brew "lima"
brew "colima"
brew "docker"
brew "docker-compose"

# kubernetes
brew "helm"
brew "kubernetes-cli"
brew "kustomize"
brew "kubectx"
brew "kube-ps1"

cask "alacritty"
cask "visual-studio-code"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-menlo-for-powerline"
cask "font-meslo-lg-nerd-font"
cask "iterm2"
cask "gimp"
cask "itsycal"

# mas "1password7", id: 1333542190
mas "Evernote", id: 406056744
mas "BetterSnapTool", id: 417375580
mas "CopyLink", id: 595191960
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Focus To-Do", id: 1258530160
mas "Owly", id: 882812218

# vscode extensions
vscode "rust-lang.rust-analyzer"
vscode "redhat.vscode-yaml"
vscode "EditorConfig.EditorConfig"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.isort"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "eamodio.gitlens"
vscode "k--kato.intellij-idea-keybindings"
vscode "hasanozgan.darkknight"
vscode "golang.go"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "GitHub.copilot"
vscode "thenikso.github-plus-theme"